In [1]:
import pandas as pd
import numpy as np

In [8]:
df_stud=pd.read_excel(r"C:\Users\LENOVO\Desktop\stud_db.xlsx",sheet_name="XII")
df_stud

   Roll Name  Marks Address  Dept
0     1   qw     76    Pune     1
1     2   df     45  Mumbai     1
2     3   vc     56  Nagpur     1
3     4   bn     78    Pune     2
4     5   hj     74  Mumbai     2
5     6   yu     49  Nagpur     2
6     7   fg     68    Pune     2
7     8   tr     84  Mumbai     1

In [5]:
df_stud[df_stud['Address']=='Pune']

   Roll Name  Marks Address  Dept
0     1   qw     76    Pune     1
3     4   bn     78    Pune     2
6     7   fg     68    Pune     2

In [8]:
df_stud[df_stud['Marks']>70][['Name']]

  Name
0   qw
3   bn
4   hj
7   tr

In [12]:
df_stud[(df_stud['Marks']<70) & (df_stud['Marks']>50)][['Name']]

  Name
2   vc
6   fg

In [16]:
df_stud['Address'].value_counts()

Pune      3
Mumbai    3
Nagpur    2
Name: Address, dtype: int64

In [17]:
df_stud[(df_stud['Address']=='Pune') | (df_stud['Address']=='Nagpur')][['Roll']]

   Roll
0     1
2     3
3     4
5     6
6     7

In [10]:
def convert(m):
    if m>80:
        return 'A'
    elif m>70:
        return 'B'
    elif m>60:
        return 'C'
    elif m>50:
        return 'D'
    else:
        return 'E'

In [11]:
df_stud['grade']=df_stud['Marks'].apply(convert)

In [12]:
df_stud

   Roll Name  Marks Address  Dept grade
0     1   qw     76    Pune     1     B
1     2   df     45  Mumbai     1     E
2     3   vc     56  Nagpur     1     D
3     4   bn     78    Pune     2     B
4     5   hj     74  Mumbai     2     B
5     6   yu     49  Nagpur     2     E
6     7   fg     68    Pune     2     C
7     8   tr     84  Mumbai     1     A

In [23]:
df_stud['Marks'].max()

84

In [26]:
df_stud['Marks'].mean()

66.25

In [30]:
df_stud.columns

Index(['Roll', 'Name', 'Marks', 'Address', 'Dept', 'grade'], dtype='object')

In [31]:
df_stud.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Roll     8 non-null      int64
 1   Name     8 non-null      object
 2   Marks    8 non-null      int64
 3   Address  8 non-null      object
 4   Dept     8 non-null      int64
 5   grade    8 non-null      object
dtypes: int64(3), object(3)
memory usage: 512.0+ bytes

In [3]:
df_stud.describe()

          Roll      Marks      Dept
count  8.00000   8.000000  8.000000
mean   4.50000  66.250000  1.500000
std    2.44949  14.469179  0.534522
min    1.00000  45.000000  1.000000
25%    2.75000  54.250000  1.000000
50%    4.50000  71.000000  1.500000
75%    6.25000  76.500000  2.000000
max    8.00000  84.000000  2.000000

In [14]:
t=df_stud['Marks'].max()

In [16]:
df_stud[df_stud['Marks']==t]['Name']

7    tr
Name: Name, dtype: object

In [18]:
t=df_stud['Marks'].min()

In [20]:
df_stud[df_stud['Marks']==t]['Name']

1    df
Name: Name, dtype: object

In [22]:
df_stud['Address'].unique()

array(['Pune', 'Mumbai', 'Nagpur'], dtype=object)

In [28]:
df_stud[(df_stud['Marks']>70) & (df_stud['Address']=='Pune')][['Name']]

  Name
0   qw
3   bn

In [33]:
df_stud[df_stud['Address']=='Pune']['Marks'].mean()

74.0

In [36]:
df_stud.groupby('Address')[['Marks']].mean()

             Marks
Address
Mumbai   67.666667
Nagpur   52.500000
Pune     74.000000

In [41]:
df_stud.groupby('grade')[['Marks']].max()

       Marks
grade
A         84
B         78
C         68
D         56
E         49

In [43]:
df_stud.groupby('grade')[['Marks']].min()

       Marks
grade
A         84
B         74
C         68
D         56
E         45

In [78]:
t=df_stud.groupby('Address')['Marks'].mean()

In [79]:
t

Address
Mumbai    67.666667
Nagpur    52.500000
Pune      74.000000
Name: Marks, dtype: float64

In [81]:
t[t>70]

Address
Pune    74.0
Name: Marks, dtype: float64

In [83]:
df_stud.head(2)

   Roll Name  Marks Address  Dept grade
0     1   qw     76    Pune     1     B
1     2   df     45  Mumbai     1     E

In [85]:
df_stud.tail(2)

   Roll Name  Marks Address  Dept grade
6     7   fg     68    Pune     2     C
7     8   tr     84  Mumbai     1     A

In [89]:
df_stud.dtypes

Roll        int64
Name       object
Marks       int64
Address    object
Dept        int64
grade      object
dtype: object

In [90]:
df_stud.groupby('Address')['Marks'].agg([np.sum,np.mean,np.std,np.max])

         sum       mean        std  amax
Address
Mumbai   203  67.666667  20.256686    84
Nagpur   105  52.500000   4.949747    56
Pune     222  74.000000   5.291503    78

In [8]:
import pandas as pd
import numpy as np
df_depts=pd.read_excel(r"C:\Users\LENOVO\Desktop\stud_db.xlsx",sheet_name="Depts")
df_depts

   dept_id          Name  HOD
0        1  Comp Science  XYZ
1        2    Statistics  PQR
2        3         Maths  MNO

In [13]:
pd.merge(df_stud,df_depts,left_on='Dept',right_on='dept_id')

   Roll Name_x  Marks Address  Dept grade  dept_id        Name_y  HOD
0     1     qw     76    Pune     1     B        1  Comp Science  XYZ
1     2     df     45  Mumbai     1     E        1  Comp Science  XYZ
2     3     vc     56  Nagpur     1     D        1  Comp Science  XYZ
3     8     tr     84  Mumbai     1     A        1  Comp Science  XYZ
4     4     bn     78    Pune     2     B        2    Statistics  PQR
5     5     hj     74  Mumbai     2     B        2    Statistics  PQR
6     6     yu     49  Nagpur     2     E        2    Statistics  PQR
7     7     fg     68    Pune     2     C        2    Statistics  PQR

In [15]:
df_depts.drop(['Name'],axis=1)

   dept_id  HOD
0        1  XYZ
1        2  PQR
2        3  MNO

In [10]:
df_depts.drop(['HOD','dept_id'],inplace=True,axis=1)
df_depts

Empty DataFrame
Columns: []
Index: [0, 1, 2]